# Essential development tools
brew "git"
brew "neovim"
brew "zellij"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "curl"

# Development tools
brew "gh"  # GitHub CLI
brew "jq"  # JSON processor
brew "lazygit"  # TUI for git operations

# Terminal and shell enhancements
brew "starship"  # Cross-shell prompt
brew "yazi"  # File manager
brew "zoxide"  # Smart directory jumping

# Image processing
brew "imagemagick"

# Web development
brew "php"

# Applications
cask "wezterm"
cask "ghostty"
cask "aerospace"  # Window tiling manager
cask "bitwarden"  # Password manager
cask "discord"  # Communication
cask "font-symbols-only-nerd-font"  # Icon font
cask "ngrok"  # Tunneling tool
cask "obs"  # Streaming software
cask "powershell"  # Microsoft shell