# Essential development tools
brew "git"
brew "neovim"
brew "zellij"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"  # Modern replacement for ls
brew "tree"
brew "curl"
brew "wget"

# Development tools
brew "gh"  # GitHub CLI
brew "jq"  # JSON processor
brew "yq"  # YAML processor

# Terminal and shell enhancements
brew "starship"  # Cross-shell prompt
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Applications
cask "wezterm"
cask "devpod"

# Optional but useful
brew "htop"
brew "bottom"  # Modern htop alternative
brew "tldr"    # Simplified man pages
brew "diff-so-fancy"  # Better git diffs